In [2]:
#printing data types
temp= 20
print(type(temp))

<class 'int'>

In [3]:
#joining two strings
import pandas as pd
import requests

str='dasdsa'
str2='adasdsadada'
combo=str + ' ' + str2
print(combo)

dasdsa adasdsadada

In [ ]:
#input variable example
num=input('input something')
print(type(num))
print(num,'something')

In [ ]:
#list enumeration
list=['paris','tokyo','Los Angeles','New York']
for index, item in enumerate(list):
    print(index, item)
print(list[1:3])

0 paris
1 tokyo
2 Los Angeles
3 New York
['tokyo', 'Los Angeles']

In [ ]:
#print position example
num=[1,3,4,5,6,7]
print(len(num)-1)

5

In [ ]:
#empty list and extend example
l=[]
l.extend([1,2,3,4,5])

In [ ]:
#dictionary example~~~~~~~~~~~~~~~~~~~~~~
user_profile = {
    "username": "john_doe_123",
    "first_name": "John",
    "last_name": "Doe",
    "email": "john.doe@example.com",
    "age": 28,
    "country": "USA",
    "city": "New York",
    "address": "123 Main St",
    "phone": "123-456-7890",
    "gender": "Male",
    "occupation": "Software Developer",
    "company": "Tech Corp",
    "website": "www.johndoe.com",
    "joined": "2020-05-01",
    "last_login": "2023-10-01",
    "followers": 4500,
    "following": 328,
    "posts": 120,
    "likes": 15000,
    "profile_pic": "path/to/profile_pic.jpg"
}

# Accessing a value by its key
age=user_profile['age']
followers=user_profile['followers']
print(age)

28

In [ ]:
#basic if statement example 1
answer=input()
if answer[0]>='A' and answer[0]<='Z':
    print('uppercase')
else:
    print('lowercase')

lowercase

In [ ]:
#basic if statement example 2
age=input('enter your age' )
age=int(age)
print(age)

if age>=12 and age<=26:
    print('youth advantage card')
elif age>=27 and age<=59:
    print('adult advantage card')
elif age>=60:
    print('Senior advantage card')
else:
    pass
    print('free!!!!!!!!!!!!!!!!!!!!!!')

2
free!!!!!!!!!!!!!!!!!!!!!!

In [ ]:
country=['paris','london','peking','tokyo','Vienna']
for c in country:
    print(c)

paris
london
peking
tokyo
Vienna

In [ ]:
country=['paris','london','peking','tokyo','Vienna']
for index,element in enumerate(country):
    print(index,element)

0 paris
1 london
2 peking
3 tokyo
4 Vienna

In [ ]:
l=[]
for i in range(5):
    l.append(i)
    print(l)

[0]
[0, 1]
[0, 1, 2]
[0, 1, 2, 3]
[0, 1, 2, 3, 4]

In [ ]:
l=[]
for i in range(3,(17),2):
    l.append(i)
    print(l)

[3]
[3, 5]
[3, 5, 7]
[3, 5, 7, 9]
[3, 5, 7, 9, 11]
[3, 5, 7, 9, 11, 13]
[3, 5, 7, 9, 11, 13, 15]

In [ ]:
l=[]
for i in range(0,4):
    for j in range(2,7):
        print(i,j)

0 2
0 3
0 4
0 5
0 6
1 2
1 3
1 4
1 5
1 6
2 2
2 3
2 4
2 5
2 6
3 2
3 3
3 4
3 5
3 6

In [ ]:
l=[]
num=int(6)
for i in range(0,num,1):
    print(i)

0
1
2
3
4
5

In [ ]:
l=[]
num=int(6)
for i in range(0,num+1,1):
    print(i)

0
1
2
3
4
5
6

In [ ]:
l=[]
num=int(6)
for i in range(num):
    print(i)

0
1
2
3
4
5

In [ ]:
l=[]
num=int(6)
for i in range(0,num+1):
    print(i)

0
1
2
3
4
5
6

In [ ]:
l=[]
num=int(6)
for i in range(0,num+1,1):
    print(i)

0
1
2
3
4
5
6

In [ ]:
l=[]
num=int(6)
for i in range(1,num):
    print(i)

1
2
3
4
5

In [ ]:
l=[]
num=int(6)
for i in range(2,num,1):
    print(i)

2
3
4
5

In [ ]:
l=[]
num=int(6)
for i in range(2,num+1,1):
    print(i)

2
3
4
5
6

In [ ]:
l=[]
num=int(6)
for i in range(2,num):
    print(i)

2
3
4
5

In [ ]:
l=[]
num=int(6)
for i in range(2,num+1):
    print(i)

2
3
4
5
6

In [ ]:
l=[]
num=int(6)
for i in range(num+1):
    print(i)

0
1
2
3
4
5
6

In [ ]:
l=[]
num=int(6)
for i in range(0,num):
    print(i)

0
1
2
3
4
5

In [ ]:
l=[]
num=int(6)
for i in range(num,0,-1):
    print(i)

6
5
4
3
2
1

In [ ]:
l=[]
num=int(6)
for i in range(num,1,-1):
    print(i)

6
5
4
3
2

In [ ]:
l=[]
num=int(6)
for i in range(num,0):
    print(i)

In [ ]:
l=[]
num=int(6)
for i in range(num,2,-1):
    print(i)

6
5
4
3

In [ ]:
l=[]
num=int(6)
for i in range(num,2):
    print(i)

In [ ]:
l=[]
num=int(6)
for i in range(num+1,0,-1):
    print(i)

7
6
5
4
3
2
1

In [ ]:
l=[]
num=int(6)
for i in range(num,2,-1):
    print(i)

6
5
4
3

In [ ]:
l=[]
num=int(6)
for i in range(num+1,0):
    print(i)

In [ ]:
l=[]
num=int(6)
for i in range(num+1,2,-1):
    print(i)

7
6
5
4
3

In [133]:
num=int(input('add a number'))

result=1
for i in range(result,num+1):
    result=result*i
    print(result)

1
2

In [ ]:


square= lambda x: x**2
print(square(2))
print(square(-2))

4
4

In [ ]:
cubic= lambda x: x**3
print(cubic(-2))
print(cubic(-2))

-8
-8

In [ ]:
exp= lambda x, b: x**b
print(exp(4,2))
print(exp(4,3))

16
64

In [ ]:
eu_dist= lambda x, y: (x-y)**2
print(eu_dist(4,2))
print(eu_dist(4,3))

4
1

In [ ]:
eu_dist= lambda x, y: (x[0]-y[0])**2+(x[1]-y[1])**2
print(eu_dist([4,1],[2,5]))

20

In [ ]:
def mario_jump():
    print('mario jump..')
mario_jump()

mario jump..

In [ ]:
jump=int(input('how many jumps?'))
def mario_jump(time):
    for t in range(time):
        print('mario jump..')
mario_jump(jump)

mario jump..
mario jump..
mario jump..
mario jump..
mario jump..

In [ ]:
def add(a,b):
    result= a + b
    return result

x,y=2,3
print(add(x,y))

5

In [ ]:
password=input('create a password 6 or more chars')

if len(password) >= 6:
    print('password accepted')
else:
    print('password not long enough')

password accepted

In [ ]:
password = input('Create a password (6 or more chars): ')

if len(password) >= 6:
    if any(char.isupper() for char in password):
        print('Password accepted')
    else:
        print('Password must contain at least one uppercase letter')
else:
    print('please try again...')

please try again...

In [ ]:
password = input('Create a password (6 or more chars): ')
def check_password(string):
    flag=False
    for s in string:
        if s.isupper():
            flag=True
            break
    return flag
check_password(password)

letter=check_password(password)
print(letter)

if len(password) >= 6 and letter==True:
     print('Password accepted')
elif len(password) >= 6 and letter==False:
    print('missing upper case char')
elif len(password) < 6 and letter==True:
    print('needs at least 6 chars')
elif len(password) < 6 and letter==False:
    print('needs at least 6 and upper case char')

True
Password accepted

In [ ]:
week=['mon','tue','wed','thu','fri','sat','sun']
for d in range(len(week)):
    print(week[d])

mon
tue
wed
thu
fri
sat
sun

In [ ]:
seq='ACBc'
def check(seq):
    count=0
    for i in range(len(seq)):
        if seq[i] >='A' and seq[i] <='Z':
            count=1
            return count
    return count

In [ ]:
seq='ACBc'
def check(seq):
    count=0
    for i in range(len(seq)):
        if seq[i] >='A' and seq[i] <='Z':
            count=1
            return count
        else:
            pass
    return count

In [ ]:
L = [155.49, 155.0, 148.56, 146.92, 143.80]
def calc_mean(seq):
    total = 0
    for element in seq:
        total += element
    
    # Calculate the mean
    mean = total / len(seq)


    return mean

# Call the function with the list L
result = calc_mean(L)
print("mean:", result)

def calc_var(seq):
    total = 0
    for element in seq:
        total += element
    
    # Calculate the mean
    mean = total / len(seq)

    # Calculate the variance
    variance = (sum((element - mean) ** 2 for element in seq)) / len(seq)
    return variance

# Call the function with the list L
result = calc_var(L)
print("Variance:", result)

mean: 149.954
Variance: 21.025904000000008

In [ ]:
# Libraries used
import os
import sys
import pandas as pd

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/weather", "weather.txt")
copy = os.path.join(current_directory, "01-data/weather", "weather_copy.txt")

df = pd.read_csv(file)
column_names=['city','temp']
df.columns = column_names

# Access the 'temp' column and store it in a list
temp_list = df['temp']
print(temp_list)

mean_temp = df['temp'].mean()
var_temp=df['temp'].var()


print('#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')
print('Mean:',mean_temp)
print('var:',var_temp)
print('mean from fx:', calc_mean(temp_list))
print('variance from fx:', calc_var(temp_list))
print('#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

df.to_csv(copy, index=False)

0    23.3
1    22.8
2    25.0
3    24.2
Name: temp, dtype: float64
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
Mean: 23.825
var: 0.9491666666666658
mean from fx: 23.825
variance from fx: 0.7118749999999994
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

In [ ]:
import os

root = os.getcwd()
files = [f for f in os.listdir(root) if f.endswith('.ipynb')]

for f in files:
    full_path = os.path.join(root, f)
    print(full_path)

/Users/danramirez/MBS/workspace_class.ipynb

In [ ]:
import random

num= int('input a number between 0  and 100')
while num > 100: 
    num= int('input a number between 0  and 100')
randint=random.randint

In [ ]:
import random

max_num = 50
code = random.randint(0, max_num)
print(code)

guess = 0

print('Guess a number between 0 and 50')
while guess != code:
    guess = int(input('What is your guess?'))
    if guess < code:
        print('The number you guessed is too low')
    elif guess > code:
        print('The number you guessed is too high')
    else:
        print('Bingo! You guessed the correct number.')

22
Guess a number between 0 and 50
The number you guessed is too low
The number you guessed is too low
Bingo! You guessed the correct number.

In [ ]:
# Libraries used
import os
import sys
import pandas as pd

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/DOW30", "Stocks_2021_2023.xlsx")
#copy = os.path.join(current_directory, "01-data/DOW30", "Dow30_2020.xlsx")

df = pd.read_excel(file)
#df.loc[(df['High']>=50) & (df['High']<=100)]
df_group=df.groupby('ticker').mean(df['Close'])
df_group
#df.loc[(df['ticker']=='AAPL') | (df['ticker']=='TSLA')]

ticker
AAPL    153.445022
GOOG    118.653742
META    247.863966
MSFT    279.771100
NVDA    228.888209
PFE      44.116310
PG      144.671433
SHEL     50.968987
TSLA    247.738862
TTE      53.150029
WMT     142.987757
Name: Close, dtype: float64

In [4]:
import os
import sys
import pandas as pd

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/uber", "Uber_supply_demand.xlsx")
#copy = os.path.join(current_directory, "01-data/DOW30", "Dow30_2020.xlsx")

df = pd.read_excel(file)
df.head()

filtered_df = df.loc[(df['status']!='Cancelled')]
filtered_hrs = df.loc[((df['Request_hour'] <= 6) | (df['Request_hour'] >= 23)) & (df['status'] != 'Cancelled')]
filtered_pick = df.loc[((df['Request_hour'] <= 6) | (df['Request_hour'] >= 23)) & (df['status'] != 'Cancelled') & (df['Pickup'] != 'City')]
pivot_table_hr = filtered_df.pivot_table(index='Request_hour', columns='status', values='Request_id', aggfunc='count')
print(pivot_table_hr)
print("~~~~~~~~~~~~~~~~~")
print("~~~~~~~~~~~~~~~~~")
pivot_table_day = filtered_df.pivot_table(index='Weekday', columns='status', values='Request_id', aggfunc='count')
print(pivot_table_day)
print("~~~~~~~~~~~~~~~~~")
print("~~~~~~~~~~~~~~~~~")
pivot_table_pickup = filtered_hrs.pivot_table(index='Pickup', columns='status', values='Request_id', aggfunc='count')
print(pivot_table_pickup)

pivot_table_pickup = filtered_pick.pivot_table(index='Weekday', columns='status', values='Request_id', aggfunc='median')
print(pivot_table_pickup)
print("~~~~~~~~~~~~~~~~~")
print("~~~~~~~~~~~~~~~~~")

#df.loc[(df['ticker']=='AAPL') | (df['ticker']=='TSLA')]

status        No Cars Available  Trip Completed
Request_hour
0                            56              40
1                            56              25
2                            57              37
3                            56              34
4                            74              78
5                            84             185
6                            86             167
7                            63             174
8                            90             155
9                            83             173
10                           65             116
11                           41             115
12                           44             121
13                           53              89
14                           37              88
15                           48             102
16                           46              91
17                          232             151
18                          322             164
19                          283             166
20                          290             161
21                          265             142
22                          138             154
23                           81             103
~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~
status     No Cars Available  Trip Completed
Weekday
Friday                   580             561
Monday                   504             601
Thursday                 571             529
Tuesday                  505             562
Wednesday                490             577
~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~
status   No Cars Available  Trip Completed
Pickup
Airport                191             331
City                   359             338
status     No Cars Available  Trip Completed
Weekday
Friday                5455.0          5566.0
Monday                  52.0           172.0
Thursday              4102.0          4206.5
Tuesday               1415.0          1523.0
Wednesday             2741.0          2898.0
~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~

In [7]:
import os
import sys
import pandas as pd
import sqlite3

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/flightdata", "flight.db")
conn = sqlite3.connect(file)

query =  """

    SELECT
        a.carrier_id,
        b.name,
		a.flight_no,
		a.actual_time,
         d.state as [departsate],
		 c.state as [arrivalstate],
        SUM(a.cancelled) as [Cancelled],
        COUNT(a.arrival_delay) as [Arrival delay count],
        COUNT(a.departure_delay) as [Departure delay count],
        COUNT(a.fid) as [Count of Flight]
    FROM flights a
    LEFT JOIN carriers b ON a.carrier_id = b.cid
    LEFT JOIN airports c ON a.arrival_aid = c.aid
    LEFT JOIN airports d ON a.departure_aid = d.aid
	
    WHERE  a.cancelled = 0 and a.month_id=7  and a.day_of_month=1  and d.state='New York'

	group by        
    	a.carrier_id,
        b.name,
		a.flight_no,
		 d.state,
		 c.state
		 
    ORDER BY a.actual_time DESC
     """

df = pd.read_sql_query(query, conn)

# Close the connection
conn.close()

df

,carrier_id,name,flight_no,actual_time,departsate,arrivalstate,Cancelled,Arrival delay count,Departure delay count,Count of Flight
0,WN,Southwest Airlines Co.,2865,325.0,New York,Nebraska,0,1,1,1
1,WN,Southwest Airlines Co.,1793,323.0,New York,Nebraska,0,1,1,1
2,HP,America West Airlines Inc. (Merged with US Air...,439,289.0,New York,Nebraska,0,1,1,1
3,HP,America West Airlines Inc. (Merged with US Air...,844,288.0,New York,Arizona,0,1,1,1
4,HP,America West Airlines Inc. (Merged with US Air...,842,285.0,New York,Arizona,0,1,1,1
...,...,...,...,...,...,...,...,...,...,...
458,US,US Airways Inc.,1299,43.0,New York,North Carolina,0,1,1,1
459,US,US Airways Inc.,1452,43.0,New York,North Carolina,0,1,1,1
460,US,US Airways Inc.,1047,41.0,New York,North Carolina,0,1,1,1
461,AA,American Airlines Inc.,1511,NaN,New York,Tennessee,0,0,1,1
462,US,US Airways Inc.,1119,NaN,New York,Oregon,0,0,1,1

In [184]:
import os
import sys
import pandas as pd
import sqlite3

# Paths and directory
current_directory = os.getcwd()
file = os.path.join(current_directory, "01-data/musicdata", "pop_music.db")
conn = sqlite3.connect(file)

#SQL queries code blocks~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
queryartists =  """
select * from artists
limit 10

     """

queryalbums =  """
select * from albums
limt 10

     """

querysongs =  """
select * from songs 
limit 10
     """

Q01 =  """
select distinct b.name as[album], c.name as [artist]

from songs a
LEFT JOIN albums b ON a.album = b._id
LEFT JOIN artists c ON b.artist = c._id

where c.name like '%AC DC%'
     """

Q02 =  """
select distinct a.title, c.name as [artist]

from songs a
LEFT JOIN albums b ON a.album = b._id
LEFT JOIN artists c ON b.artist = c._id

where c.name like '%beatles%'
     """

Q03 =  """
select distinct c.name as [artist],count(a.title) as [Love Song count]

from songs a
LEFT JOIN albums b ON a.album = b._id
LEFT JOIN artists c ON b.artist = c._id
where a.title like '%love%'
group by c.name
order by count(a.title) desc
     """

Q04 =  """
select distinct 
c.name as [artist],count(1) as [song count]

from songs a
LEFT JOIN albums b ON a.album = b._id
LEFT JOIN artists c ON b.artist = c._id

group by c.name

order by count(b.name) desc
     """

Q05 =  """
select distinct 
b.name as [artist],count(a.name) as [album couunt]

from albums a
LEFT JOIN artists b ON a.artist = b._id

group by b.name
order by count(a.name) desc
limit 5

     """

Q06 =  """
select distinct b.name as[album],a.title,c.name

from songs a
LEFT JOIN albums b ON a.album = b._id
LEFT JOIN artists c ON b.artist = c._id

where c.name like '%queen%'

order by b.name
     """

#SQL code execution~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
dfq1 = pd.read_sql_query(Q01, conn)
dfq2 = pd.read_sql_query(Q02, conn)
dfq3 = pd.read_sql_query(Q03 , conn)
dfq4 = pd.read_sql_query(Q04 , conn)
dfq5 = pd.read_sql_query(Q05 , conn)
dfq6 = pd.read_sql_query(Q06 , conn)

# Close the connection
conn.close()

In [185]:
print('10 records from songs table')

10 records from songs table

In [186]:
print('Q1. Display all the albums by AC DC')
dfq1

Q1. Display all the albums by AC DC

                                     album artist
0  For Those About To Rock (We Salute You)  AC DC
1          If You Want Blood You've Got It  AC DC

In [187]:
print('Q2. Display all songs by "Beatles')
dfq2

Q2. Display all songs by "Beatles

                                              title   artist
0             Sgt. Pepper's Lonely Hearts Club Band  Beatles
1                With A Little Help From My Friends  Beatles
2                     Lucy In The Sky With Diamonds  Beatles
3                                 A Day In The Life  Beatles
4                         Good Morning Good Morning  Beatles
5                                     Fixing A Hole  Beatles
6                                       Lovely Rita  Beatles
7                                She's Leaving Home  Beatles
8                               When I'm Sixty-Four  Beatles
9                 Being For The Benefit Of Mr. Kite  Beatles
10                           Within You Without You  Beatles
11                                   Getting Better  Beatles
12  Sgt. Pepper's Lonely Hearts Club Band (reprise)  Beatles

In [188]:
print('Q3. Show all information about the song with love in its title (i.e., song title,album name, and artist name.)')
dfq3

Q3. Show all information about the song with love in its title (i.e., song title,album name, and artist name.)

           artist  Love Song count
0    Led Zeppelin               10
1   Fleetwood Mac                9
2     Deep Purple                9
3       Kate Bush                6
4          Troggs                5
..            ...              ...
91    Bad Company                1
92      B.B. King                1
93        Animals                1
94   Alice Cooper                1
95           10cc                1

[96 rows x 2 columns]

In [189]:
print('Q4. In the database, which artist or band has recorded the most songs ever?')
dfq4

Q4. In the database, which artist or band has recorded the most songs ever?

                artist  song count
0         Led Zeppelin         166
1        Black Sabbath         158
2       Axel Rudi Pell         157
3          Deep Purple         155
4            Aerosmith         151
..                 ...         ...
195  Vladimir Vysotsky           1
196    Meredith Brooks           1
197       Corey Taylor           1
198  Bruce Springsteen           1
199         Billy Joel           1

[200 rows x 2 columns]

In [190]:
print('Q5. Show the top 5 artists (including bands) with the most albums.')
dfq5

Q5. Show the top 5 artists (including bands) with the most albums.

           artist  album couunt
0   Black Sabbath            18
1  Axel Rudi Pell            15
2    Led Zeppelin            14
3     Deep Purple            13
4       Aerosmith            13

In [191]:
print('Q6. Show all songs and the album information of each song by Queen,including song title, album name, and artist name.\
(note: Queen is an artist.)')
dfq6

Q6. Show all songs and the album information of each song by Queen,including song title, album name, and artist name.(note: Queen is an artist.)

,album,title,name
0,Innuendo,Headlong,Queen
1,Innuendo,All God's People,Queen
2,Innuendo,The Show Must Go On,Queen
3,Innuendo,Bijou,Queen
4,Innuendo,I Can't Live With You,Queen
5,Innuendo,The Hitman,Queen
6,Innuendo,Innuendo,Queen
7,Innuendo,I'm Going Slightly Mad,Queen
8,Innuendo,Ride the Wild Wind,Queen
9,Innuendo,Delilah,Queen
10,Innuendo,These Are the Days of Our Lives,Queen
11,Innuendo,Don't Try So Hard,Queen
12,Innuendo Disk 2,Headlong (embryo with guide vocal),Queen
13,Innuendo Disk 2,I'm Going Slightly Mad (mad_mix),Queen
14,Innuendo Disk 2,Lost Opportunity (B-Side),Queen
15,Innuendo Disk 2,I Can't Live With You (1997 - Rocks retake),Queen
16,Innuendo Disk 2,Ride the Wild Wind (early version with guide v...,Queen
17,Sheer Heart Attack,In The Lap Of The Gods,Queen
18,Sheer Heart Attack,In The Lap Of The Gods ... Revisited,Queen
19,Sheer Heart Attack,Brighton Rock,Queen
20,Sheer Heart Attack,She Makes Me (Stormtrooper In Stilettos),Queen
21,Sheer Heart Attack,Lily Of The Valley,Queen
22,Sheer Heart Attack,Tenement Funster,Queen
23,Sheer Heart Attack,Now I'm Here,Queen
24,Sheer Heart Attack,Killer Queen,Queen
25,Sheer Heart Attack,Dear Friends,Queen
26,Sheer Heart Attack,Flick Of The Wrist,Queen
27,Sheer Heart Attack,Stone Cold Crazy,Queen
28,Sheer Heart Attack,Bring Back That Leroy Brown,Queen
29,Sheer Heart Attack,Misfire,Queen
30,The Miracle,Breakthru,Queen
31,The Miracle,My Baby Does Me,Queen
32,The Miracle,The Invisible Man,Queen
33,The Miracle,Hang On In There,Queen
34,The Miracle,Chinese Torture,Queen
35,The Miracle,Scandal,Queen
36,The Miracle,The Miracle,Queen
37,The Miracle,I Want It All,Queen
38,The Miracle,Rain Must Fall,Queen
39,The Miracle,Khashoggi's Ship,Queen
40,The Miracle,Was It All Worth It,Queen
41,The Miracle,Party,Queen